11.Create a dataframe of ten rows, four columns with random values. Convert some values to nan values. Write a Pandas program which will highlight the nan values

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10, 4), columns=list('ABCD'))
df.iloc[1, 2] = np.nan
df.iloc[4, 0] = np.nan
df.iloc[7, 3] = np.nan
def highlight_nan(s):
    return ['background-color: yellow' if pd.isna(v) else '' for v in s]
styled_df = df.style.apply(highlight_nan)
styled_df

12.Create a dataframe of ten rows, four columns with random values. Write a Pandas program to set dataframe background Color black and font color yellow.

In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10, 4), columns=list('ABCD'))
styled_df = df.style.set_properties(**{
    'background-color': 'black',
    'color': 'yellow'
})
styled_df

13.Write a Pandas program to detect missing values of a given DataFrame. Display True or False.

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'ord_no':  [70001, np.nan, 70002, 70004, np.nan, 70005, np.nan, 70010, 70003, 70012, np.nan, 70013],
    'purch_amt': [150.50, 270.65, 65.26, 110.50, 948.50, 2400.60, 5760.00, 1983.43, 2480.40, 250.45, 75.29, 3045.60],
    'ord_date': ['2012-10-05','2012-09-10', np.nan ,'2012-08-17','2012-09-10','2012-07-27',
                 '2012-09-10','2012-10-10','2012-10-27','2012-06-27','2012-10-17','2012-04-25'],
    'customer_id': [3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
    'salesman_id': [5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]
})
print(df.isnull())

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

14. Write a Pandas program to find and replace the missing values in a given DataFrame which do not have any valuable information.

In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'ord_no':  [70001, np.nan, 70002, 70004, np.nan, 70005, '--', 70010, 70003, 70012, np.nan, 70013],
    'purch_amt': [150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, '?', 12.43, 2480.4, 250.45, 3045.6],
    'ord_date': ['?', '2012-09-10', np.nan, '2012-08-17', '2012-09-10', '2012-07-27',
                 '2012-09-10', '2012-10-10', '2012-10-10', '2012-06-27', '2012-08-17', '2012-04-25'],
    'customer_id': [3002,3001,3001,3003,3002,3001,3001,3004,'--',3002,3001,3001],
    'salesman_id': [5002,5003,'?',5001,np.nan,5002,5001,'?',5003,5002,5003,'--']
})
df.replace(["?", "--"], np.nan, inplace=True)
df = df.fillna(method='ffill')
print(df)

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50         NaN       3002.0       5002.0
1   70001.0     270.65  2012-09-10       3001.0       5003.0
2   70002.0      65.26  2012-09-10       3001.0       5003.0
3   70004.0     110.50  2012-08-17       3003.0       5001.0
4   70004.0     948.50  2012-09-10       3002.0       5001.0
5   70005.0    2400.60  2012-07-27       3001.0       5002.0
6   70005.0    5760.00  2012-09-10       3001.0       5001.0
7   70010.0    5760.00  2012-10-10       3004.0       5001.0
8   70003.0      12.43  2012-10-10       3004.0       5003.0
9   70012.0    2480.40  2012-06-27       3002.0       5002.0
10  70012.0     250.45  2012-08-17       3001.0       5003.0
11  70013.0    3045.60  2012-04-25       3001.0       5003.0

/tmp/ipython-input-1668849007.py:11: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace(["?", "--"], np.nan, inplace=True)
/tmp/ipython-input-1668849007.py:12: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df = df.fillna(method='ffill')

15.Write a Pandas program to keep the rows with at least 2 NaN values in a given DataFrame.

In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'ord_no':[np.nan, np.nan,70002,np.nan,np.nan,70005,np.nan,70010,70003,70012,np.nan,np.nan],
    'purch_amt':[np.nan,270.65,65.26,np.nan,948.5,2400.6,5760,1983.43,2480.4,250.45,75.29,np.nan],
    'ord_date':[np.nan,'2012-09-10',np.nan,np.nan,'2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17',np.nan],
    'customer_id':[np.nan,3001,3001,np.nan,3002,3001,3001,3004,3003,3002,3001,np.nan]
})
result = df[df.isnull().sum(axis=1) >= 2]
print(result)

    ord_no  purch_amt ord_date  customer_id
0      NaN        NaN      NaN          NaN
3      NaN        NaN      NaN          NaN
11     NaN        NaN      NaN          NaN

16.Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.

In [6]:
import pandas as pd
df = pd.DataFrame({
    'school': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V','V','VI','VI','VI','VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes','Eesha Hinton','Gino Mcneill','David Parkes'],
    'age': [12,12,13,13,14,12]
})
g = df.groupby('school')
for key, group in g:
    print("\nGroup:", key)
    print(group)
print("\nType of GroupBy object:", type(g))

Group: s001
  school class            name  age
0   s001     V  Alberto Franco   12
3   s001    VI    Eesha Hinton   13

Group: s002
  school class          name  age
1   s002     V  Gino Mcneill   12
4   s002    VI  Gino Mcneill   14

Group: s003
  school class         name  age
2   s003    VI  Ryan Parkes   13

Group: s004
  school class          name  age
5   s004    VI  David Parkes   12

Type of GroupBy object: <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

17.Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

In [7]:
import pandas as pd
df = pd.DataFrame({
    'school': ['s001','s002','s003','s001','s002','s004'],
    'age': [12,12,13,13,14,12]
})
result = df.groupby('school')['age'].agg(['mean','min','max'])
print(result)

        mean  min  max
school
s001    12.5   12   13
s002    13.0   12   14
s003    13.0   13   13
s004    12.0   12   12

18.Write a Pandas program to split the following given dataframe into groups based on school code and class.

In [8]:
import pandas as pd
df = pd.DataFrame({
    'school': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V','V','VI','VI','V','VI'],
    'name': ['Alberto','Gino','Ryan','Eesha','Gino','David']
})
groups = df.groupby(['school','class'])
for key, group in groups:
    print("\nGroup:", key)
    print(group)

Group: ('s001', 'V')
  school class     name
0   s001     V  Alberto

Group: ('s001', 'VI')
  school class   name
3   s001    VI  Eesha

Group: ('s002', 'V')
  school class  name
1   s002     V  Gino
4   s002     V  Gino

Group: ('s003', 'VI')
  school class  name
2   s003    VI  Ryan

Group: ('s004', 'VI')
  school class   name
5   s004    VI  David

19.Write a Pandas program to display the dimensions or shape of the World alcohol consumption dataset. Also extract the column names from the dataset.

In [9]:
import pandas as pd
data = {
    'Year': [1986, 1986, 1985, 1986, 1987],
    'WHO_Region': ['Western Pacific', 'Americas', 'Africa', 'Americas', 'Americas'],
    'Country': ['Viet Nam', 'Uruguay', 'Cote dIvoire', 'Colombia', 'Saint Kitts and Nevis'],
    'Beverage_Types': ['Wine', 'Other', 'Wine', 'Beer', 'Beer'],
    'Display_Value': [0.00, 0.50, 1.62, 4.27, 1.98]
}
df = pd.DataFrame(data)
print("Shape:", df.shape)
print("Columns:", df.columns)

Shape: (5, 5)
Columns: Index(['Year', 'WHO_Region', 'Country', 'Beverage_Types', 'Display_Value'], dtype='object')

20.Write a Pandas program to find the index of a given substring of a DataFrame column.

In [10]:
import pandas as pd
df = pd.DataFrame({
    'names': ['Alberto', 'Franco', 'Gino', 'Mcneill']
})
result = df['names'].str.find('co')
print(result)

0   -1
1    4
2   -1
3   -1
Name: names, dtype: int64